<template>
  <Loader v-if="loading"/>
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestionsSection :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="400"
    title="Розумна антипотоп система <span>під ключ</span>"
    text="Ми впевнені, що з розумним будинком ваше приміщення стане втіленням мрії про ідеальне життя. Відчуйте справжню розкіш комфорту та безпеки."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'AntifloodSystem',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'security-function-3',
          icon: 'white-drop',
          title: 'Антипотоп система',
          text: 'Забезпечує захист від затоплення, заздалегідь виявляючи несправності сантехніки та вживаючи відповідні заходи для запобігання затоплення і його наслідків.',
          price: '400',
        },
        benefits: [
          {
            id: 1,
            title: 'Захист',
            text: 'Ви можете бути спокійні за цілісність свого майна та майна сусідів. Розумна сантехніка заздалегідь ' +
              'помітить зміну тиску у трубах і зупинить подачу води, усунувши потоп.',
          },
          {
            id: 2,
            title: 'Розумна інвестиція',
            text: 'Затоплена ванна кімната чи кухня – це завжди дорого, адже часто приходиться оплачувати не лише свій ремонт,' +
              ' а й сусідів знизу. Система антипотопу окупає себе у десятки разів.',
          },
          {
            id: 3,
            title: 'Моніторінг у реальному часі',
            text: 'Ви отримаєте повідомлення на телефон при будь-яких аномальних змінах у роботі сантехніки. Розумні ' +
              'датчики сповістять вас навіть про відсутність води у системі.',
          },
        ],
        functions: {
          image: 'antiflood',
          title: 'Можливості системи антипотопу',
          text: 'Розумна система антипотопу усуне лихо, спрогнозувавши його заздалегідь.',
          dropdownList: [
            {
              title: 'Виявлення потопу до його початку',
              text: 'Розумні датчики зафіксують аномальну зміну тиску у трубах, що є сигналом початку утворення потопу.',
            },
            {
              title: 'Автоматичне перекриття подачі води',
              text: 'Як тільки датчики зафіксували ймовірність потопу – подача води у системі миттєво перекривається, а ви отримаєте повідомлення на телефон про це.',
            },
            {
              title: 'Віддалене керування та моніторінг',
              text: ' Ви будете отримувати повідомлення про усі важливі зміни у системі водозабезпечення вашої оселі, ' +
                'наприклад про відсутність води у системі чи успішне запобігання потопу. Також є можливість віддаленого ' +
                'керування розумною сантехнікою прямо зі смартфону.',
            },
            {
              title: 'Сирена та виклик служби обслуговування',
              text: 'За потреби систему антипотопу можна доєднати до сирени чи інтегрувати з викликом служби сантехнічного обслуговування будинку чи квартири.',
            }
          ]
        },
        equipment: {
          title: 'З чого складається система антипотопу',
          text: 'Пристрої, що входять до системи антипотопу. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'antiflood',
              title: 'Датчик протікання води',
              text: 'Реагує на аномальну концентрацію води у певній точці приміщення.',
            },
            {
              image: 'smart-faucet',
              title: 'Розумний кран',
              text: 'Шаровий кран з електроприводом. Усуває потоп до його початку.',
            },
            {
              image: 'lighting-control-relay',
              title: 'Реле керування освітленням',
              text: 'Забезпечує автоматизацію керування світлом та ел. приладами.',
            },
            {
              image: 'server',
              title: 'Сервер',
              text: 'Синхронізує роботу усіх пристроїв розумного будинку.',
            }
          ]
        },
        choose: {
          icon: 'white-drop',
          title: 'Як правильно обрати систему антипотопу',
          text: 'Системи антипотопу існують декількох видів: ті, що розпізнають потоп і перекривають подачу води по факту його ' +
            'здійснення на ранній стадії та такі, що можуть спрогнозувати потоп заздалегідь, перекривши воду ще до його початку. ' +
            'Ми встановлюємо обидва типи систем, але завжди рекомендуємо нашим клієнтам другий, адже це найбільш комплексний варіант, ' +
            'що суттєво зекономить ваші гроші при потенційних ризиках. \n' +
            'Зазвичай система антипотопу складається з 3-х основних складових: це датчики, контролери та розумні крани. ' +
            'Кожна з них має свою низку характеристик. Ми допоможемо підібрати найкраще рішення для вашого випадку на безкоштовні консультації.',
        },
        automations: [
          {
            title: 'Трігер: Виявлення затоплення або підвищеної вологості',
            options: [
              {
                icon: 'blue-drop',
                name: 'Відключення водопостачання'
              },
              {
                icon: 'blue-iphone',
                name: 'Повідомлення на ваш телефон'
              },
              {
                icon: 'blue-phone',
                name: 'Виклик служби обслуговування'
              }
            ]
          },
          {
            title: 'Трігер: Виявлення підвищеного тиску в водопостачанні',
            options: [
              {
                icon: 'blue-drop',
                name: 'Перекриття подачі води ще до виникнення потопу'
              },
              {
                icon: 'blue-multiroom',
                name: 'Попередження через голосового асистента'
              },
              {
                icon: 'blue-iphone',
                name: 'Повідомлення на ваш телефон'
              }
            ]
          },
          {
            title: 'Трігер: Відсутність води у системі',
            options: [
              {
                icon: 'blue-multiroom',
                name: 'Попередження через голосового асистента'
              },
              {
                icon: 'blue-iphone',
                name: 'Повідомлення на ваш телефон'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги системи бездротового розумного будинку',
          text: 'Бездротовий розумний будинок - це нова ера в сфері розумних систем,  де комфорт, безпека та ' +
            'енергоефективність поєднуються в одному рішенні. Відкрийте для себе магію технологій без зайвих проводів і обмежень.',
          dropdownList: [
            {
              title: 'Швидка та легка інтеграція на будь-якому етапі',
              text: 'Система бездротового розумного будинку дозволяє здійснювати просту інсталяцію незалежно від типу при ' +
                'міщення, без зайвих дротів та шнурів, не потребуючи втручання у готовий ремонт будівлі, залишаючи стіни цілими.',
            },
            {
              title: 'Приваблива вартість',
              text: 'Порівняно з дротовими системами, бездротовий розумний будинок пропонує економічність завдяки меншій' +
                ' кількості необхідного обладнання та зменшеному обсягу робіт. Це дозволяє вам отримати передові технології без переплат. ',
            },
            {
              title: 'Легке інтегрування нових або додаткових елементів',
              text: 'Передові технології забезпечують швидке і просте інтегрування будь-яких нових пристроїв, дозволяючи ' +
                'розширювати функціонал вашого будинку та насолоджуватися останніми інноваціями у світі розумних пристроїв.',
            },
            {
              title: 'Керування без Інтернету',
              text: 'Керування без інтернету у бездротовому розумному будинку можливе завдяки локальним мережам і технологіям, ' +
                'що дозволяють пристроям безперебійно взаємодіяти один з одним.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Так скільки коштує?',
            text: 'На нашому сайті ви знайдете зручний калькулятор, який дозволяє приблизно розрахувати вартість для вашої ' +
              'конкретної ситуації. Однак кожен розумний будинок унікальний, тому точніше вам підкаже наш майстер під час ' +
              'безкоштовної консультації. Але ми впевнені, що ціна вас приємно здивує, адже розумний будинок це не так дорого, як всі звикли вважати!',
          },
          {
            title: 'Скільки часу займає встановлення?',
            text: '200+ наших клієнтів насолоджується розумним будинком вже через 3 дні після замовлення. Приєднуйтесь до' +
              ' ексклюзивної спільноти задоволених клієнтів всього в 3 кроки: 1. Подзвоніть нам для безкоштовної консультації ' +
              'та отримайте зрозумілі відповіді. 2. Отримайте рекомендації від нашого майстра при огляді об’єкту. 3. Довірте' +
              ' спеціалістам професійне встановлення та якісне налаштування всіх функцій системи.',
          },
          {
            title: 'Чи можу я розширити свою систему розумного будинку у майбутньому?',
            text: 'Так, система бездротового розумного будинку зроблена з урахуванням масштабованості. Ви зможете додавати ' +
              'нові пристрої, різні сценарії для ваших приладів та функціональні можливостів майбутньому.',
          },
          {
            title: 'Чи складно встановити розумний будинок?',
            text: 'Бездротова технологія значно спрощує процес встановлення, оскільки відсутні кабелі, які потребують складної ' +
              'прокладки. Ви зможете швидко насолоджуватися всіма перевагами розумного будинку без зайвих клопотів за короткий проміжок часу.',
          },
          {
            title: 'Які пристрої можна інтегрувати в розумний будинок?',
            text: 'Майже всі, що працюють, використовуючи електроенергію.',
          },
          {
            title: 'Чи можу я інтегрувати розумний будинок, не купуючи нову техніку?',
            text: 'В більшості випадків - так. Практично всі сучасні пристрої мають можливість під’єднання до бездротового ' +
              'розумного будинку, саме в цьому полягає перевага цієї системи. Проте умови бувають різні, наш майстер ' +
              'оцінить вашу ситуацію та дасть остаточну відповідь під час консультації.',
          },
          {
            title: 'Які можливості керування доступні для розумного будинку?',
            text: 'Ви зможете зручно керувати вашим розумним будинком через мобільний додаток на смартфоні або планшеті, а ' +
              'також за допомогою голосових помічників, що забезпечить комфорт у кожному куточку вашої оселі.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }
})
</script>

<style scoped lang="scss">
@import 'vars';

</style>