<template>
  <Loader v-if="loading"/>
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestions :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="900"
    title="Розумні Автоматичні штори <span>під ключ</span>"
    text="Дистанційне керування шторами – це топове рішення для квартири та приватного будинку, що буквально розв’яже вам руки."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystemSection from "~/components/indexSections/WirelessSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'AutomaticCurtains',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    WirelessSystemSection,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'comfort-function-6',
          icon: 'white-blinds',
          title: 'Автоматичні штори',
          text: 'Дистанційне керування шторами – це топове рішення для квартири та приватного будинку, що буквально розв’яже вам руки. Впускайте денне світло чи створюйте ніч тоді, коли забажаєте.',
          price: '900',
          service: 'Функції комфорту'
        },
        benefits: [
          {
            id: 1,
            title: 'Зручність',
            text: 'Керуйте шторами з будь-якого місця, у тому числі дистанційно. Особливо це актуально, якщо доводиться відправлятись у тривалі відрядження. Це стане одним із компонентів захисту від зловмисників.',
          },
          {
            id: 2,
            title: 'Універсальність',
            text: 'Зробіть саме ті налаштування, які ви вважаєте за потрібне: відкривання/закривання в певний час, реакція на зовнішні чинники чи інші фактори.',
          },
          {
            id: 3,
            title: 'Режими та сценарії',
            text: 'Управління шторами в «розумному домі» можливе з використанням самостійно розроблених сценаріїв, які прив’язуються до інших датчиків та систем у будинку.',
          },
        ],
        functions: {
          image: 'automatic-curtains',
          title: 'Можливості системи управління шторами та жалюзі',
          text: '«Розумні» штори подарують комфорт всім жителям будинку чи квартири та додадуть безпечності вашому життєвому простору:',
          dropdownList: [
            {
              title: 'Захист від сторонніх очей',
              text: 'Ви можете закрити штори, коли побажаєте, наприклад, помітивши, що хтось зазирає у вікно. Управління ' +
                'ними допомагає тримати ваше приватне життя під замком.',
            },
            {
              title: 'Безпека',
              text: ' У комбінації з іншими системами можна створити ефект присутності, навіть якщо ви знаходитесь далеко ' +
                'від дому. Вмикайте світло, зачиняйте штори/жалюзі або ж налаштовуйте інші необхідні сценарії.',
            },
            {
              title: 'Керування з телефона',
              text: 'Запізнюєтеся з роботи чи застрягли в пробці? Закрийте штори, щоб ніхто не подумав, що вас немає вдома. ' +
                'Інший варіант – відкривайте та впускайте сонце в кімнату, якщо дуже не хочеться прокидатись, а денне світло – це єдине, що може вас розбудити.',
            },
            {
              title: 'Створення умов для сну',
              text: 'Маєте малих дітей чи самі не можете заснути вдень, але це необхідно зробити? Вмощуйтесь зручніше та швидше зачиняйте штори в пару кліків на смартфоні.',
            },
            {
              title: 'Функціонування з іншими системами',
              text: 'Управління жалюзі в «розумному домі» дуже легко інтегрується з іншими системами. Налаштуйте сценарій: ' +
                'закрили штори, увімкнулось світло чи інші варіанти, які підходять саме до вашого способу життя.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається автоматизація штор чи ролетів',
          text: 'Пристрої, що входять до автоматизації штор чи ролетів. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'smart-curtain-rod',
              title: 'Розумний карниз',
              text: 'Має рухомі елементи, що керуються мотором. Має віддалене керування.',
            },
            {
              image: 'motor-for-curtains',
              title: 'Мотор для штор',
              text: 'Рухає штори автоматично у розумному карнизі.',
            },
            {
              image: 'server',
              title: 'Сервер',
              text: 'Синхронізує роботу усіх пристроїв розумного будинку.',
            }
          ]
        },
        choose: {
          icon: 'white-blinds',
          title: 'Як вибрати «розумні» штори',
          text: 'Для того щоб правильно вибрати «розумні» штори та їхній функціонал, чітко визначтесь зі своїми потребами: як плануєте управляти,' +
            ' чи хочете інтегрувати до інших елементів розумного будинку, скільки та які сценарії будете створювати. Також потрібно знати точні розміри вікна чи іншого отвору, який хочете закрити полотнами, що ними зможете управляти дистанційно. Встановлення «розумних» штор під ключ від нашої компанії мінімізує ваші клопоти.',
        },
        automations: [
          {
            title: 'Трігер: Ви хочете підвищити якість свого сну',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Налаштовуєте розклад роботи штор у додатку'
              },
              {
                icon: 'blue-blinds',
                name: 'Штори автоматично закриваються на ніч перед сном'
              },
              {
                icon: 'blue-multiroom',
                name: 'Програються звуки океану'
              },
              {
                icon: 'blue-blinds',
                name: 'Штори автоматично відкриваються за 30 хвилин до вашого будильнику'
              }
            ]
          },
          {
            title: 'Трігер: Адаптивні штори та ролети',
            options: [
              {
                icon: 'blue-user',
                name: 'Ви пересуваєтеся своєю оселею'
              },
              {
                icon: 'blue-blinds',
                name: 'Штори та ролети автоматично відкриваються у тих кімнатах, де ви знаходитеся'
              }
            ]
          },
          {
            title: 'Трігер: Зміна погоди за вікном',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Ви налаштовуєте інтеграцією з погодою у додатку'
              },
              {
                icon: 'blue-blinds',
                name: 'Положення штор та ролетів підлаштовується під поточну погоду'
              },
              {
                icon: 'blue-smile',
                name: 'Зростає комфорт і енергоефективність будинку'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги «розумних» штор та жалюзі',
          text: '«Розумні» штори – це сучасне й дійсно дуже комфортне рішення для житла і не тільки. Зручно, що їх монтаж можливий у будь-якому ' +
            'приміщенні, незалежно від того, відбувається в ньому ремонт чи вже давно завершений.',
          dropdownList: [
            {
              title: 'Різні конструкції',
              text: 'Ролети або жалюзі на дистанційному керуванні бувають розсувними чи піднімними. Вибір того чи іншого рішення залежить від протисонцевої системи, яку вибрали для ' +
                'використання. Конструкція встановлюється зверху віконного отвору або ж безпосередньо на стелі.',
            },
            {
              title: 'Використання штор із будь-яких тканин',
              text: 'Електромотор, який є частиною системи, підбирається за потужністю, щоб він зміг пересувати навіть важкі полотна. Відкрити/закрити їх ' +
                'можна, скориставшись настінною панеллю, пультом або ж програмою на смартфоні.',
            },
            {
              title: 'Легкість використання',
              text: 'Управління жалюзі в «розумному домі», як і ролетами, – це абсолютно просте завдання. Причому в будь-який момент самостійно можете визначити, який варіант вам підходить.',
            },
            {
              title: 'Універсальне застосування',
              text: 'Встановлення таких штор можливе не лише на вікна, але й на інших ділянках приміщення. Це дає ще одну перевагу – просте та швидке масштабування та зонування в разі потреби.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Яке обладнання треба встановити, щоб шторм стали «розумними»?',
            text: 'Для автоматизації штор потрібно встановити розумний мотор та карниз під нього. Також у приміщення ми встановлюємо шлюз, який ' +
              'відправляє команди на сервер та дає змогу пристроям взаємодіяти між собою.',
          },
          {
            title: 'Ви виготовляєте карнизи під мої розміри?',
            text: 'Так, карнизи ми виготовляємо індивідуально під розміри Вашого вікна, з точністю до міліметра.',
          },
          {
            title: 'Чи можете зробити кутові карнизи?',
            text: 'Так, кутові карнизи теж робимо.',
          },
          {
            title: 'Якщо у мене велике вікно (7+ метрів) і поворот на 180 градусів, ви зможете зробити?',
            text: 'Це не проблема, будь-які розміри та кути ми можемо реалізувати.',
          },
          {
            title: 'Яка ціна?',
            text: 'Ціна на одне стандартне вікно (2–3 метри) становить 500–600 $ (залежно від складності монтажу). Але точну вартість ' +
              'зможуть сказати наші майстри після виїзної консультації.',
          },
          {
            title: 'Чи можете встановити штори на мій звичайний карниз?',
            text: 'На жаль, ні. Кожен наш карниз має спеціальний вихід під мотор, який рухає штори.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>