<template>
  <Loader v-if="loading" />
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestionsSection :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="350"
    title="Розумна протипожежна система <span>під ключ</span>"
    text="Ми впевнені, що з розумним будинком ваше приміщення стане втіленням мрії про ідеальне життя. Відчуйте справжню розкіш комфорту та безпеки."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'FireProtectionSystem',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'security-function-2',
          icon: 'white-fire',
          title: 'Протипожежна система',
          text: 'Забезпечує надійний захист від можливого виникнення пожежі шляхом раннього виявлення пожежі, сповіщення про неї та вжиття необхідних заходів для зменшення ризику.',
          price: '350',
          service: 'Функції безпеки'
        },
        benefits: [
          {
            id: 1,
            title: 'Захист',
            text: 'Протипожежна система в розумному будинку – це надійний страж безпеки, що оперативно реагує на виявлення пожежі, ' +
              'миттєво сигналізуючи та ініціюючи необхідні заходи.',
          },
          {
            id: 2,
            title: 'Економія та безпека',
            text: 'Забезпечуючи раннє виявлення можливих загроз та пожежний контроль, ця система допомагає уникнути ' +
              'серйозних матеріальних збитків та врятувати життя.',
          },
          {
            id: 3,
            title: 'Віддалене керування',
            text: 'Дозволяє вам віддалено стежити за станом вашої оселі, а також автоматизувати взаємодію з іншими ' +
              'елементами системи управління будинком.',
          },
        ],
        functions: {
          image: 'fire-detector-illustration',
          title: 'Можливості протипожежної системи',
          text: 'Розумна протипожежна система подбає про вашу безпеку, сповістить про загрозу і автоматично усуне її.',
          dropdownList: [
            {
              title: 'Попередження пожежі',
              text: 'Датчики диму, вогню та вуглекислого газу заздалегідь повідомлять про потенційну небезпеку.',
            },
            {
              title: 'Автоматична пожежна тривога',
              text: 'У разі виявлення потенційної пожежі у будинку задзвонить сирена, що сповістить усіх мешканців про ' +
                'небезпеку і необхідність термінової евакуації. Мешканці також отримають термінове повідомлення про лихо на телефон, якщо вони не вдома.',
            },
            {
              title: 'Автоматичний виклик пожежної служби',
              text: 'Разом зі спрацюванням пожежної тривоги можна налаштувати і автоматичний виклик пожежників.',
            },
            {
              title: 'Відстеження рівня вуглекислого газу',
              text: 'Датчики, що використовуються напряму для забезпечення пожежної безпеки також будуть у нагоді і для ' +
                'виявлення високого рівню чадного газу у приміщенні, що може врятувати життя мешканцям.',
            },
            {
              title: 'Віддалене керування та сповіщення через телефон',
              text: 'При наймалішому виникненні загрози пожежі ви одразу отримаєте повідомлення на телефон про це. Ви ' +
                'також можете моніторити стан вашої оселі через додаток, або налаштувати вивід голосових повідомлень через розумні колонки-асистенти.',
            }
          ]
        },
        equipment: {
          title: 'З чого складається система пожежної безпеки',
          text: 'Пристрої, що входять до системи пожежної безпеки. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'sensor',
              title: 'Датчик газу',
              text: 'Реагує на аномально підвищену концентрацію газу у повітрі.',
            },
            {
              image: 'sensor',
              title: 'Датчик диму',
              text: 'Реагує на аномально підвищену концентрацію диму у повітрі.',
            },
            {
              image: 'lighting-control-relay',
              title: 'Реле керування освітленням',
              text: 'Забезпечує автоматизацію керування світлом та ел. приладами.',
            },
            {
              image: 'server',
              title: 'Сервер',
              text: 'Синхронізує роботу усіх пристроїв розумного будинку.',
            }
          ]
        },
        choose: {
          icon: 'white-fire',
          title: 'Як правильно обрати протипожежну систему',
          text: 'Обираючи протипожежну систему для розумного будинку, визначте специфічні потреби та ризики вашого об\'єкта, ' +
            'враховуючи його розмір та призначення. Перевірте, чи система відповідає стандартам безпеки та має відповідні сертифікації, гарантуючи її надійність. \n' +
            'З міркувань раціональної економії ви можете обладнати протипожежною системою лише ті зони та приміщення, які ' +
            'потенційно мають найбільший рівень пожежної загрози. Наша команда з задоволенням відповість на усі питання і допоможе обрати найкраще рішення саме під ваш випадок.',
        },
        automations: [
          {
            title: 'Трігер: Датчик ідентифікує аномальну температуру або дим у певній зоні приміщення',
            options: [
              {
                icon: 'blue-alarm',
                name: 'Сирена'
              },
              {
                icon: 'blue-multiroom',
                name: 'Виклик пожежної безпеки'
              },
              {
                icon: 'blue-bolt',
                name: 'Вимкнення усіх електроприладів'
              }
            ]
          },
          {
            title: 'Трігер: Велика концентрація диму та вуглекислого газу у кімнаті',
            options: [
              {
                icon: 'blue-multiroom',
                name: 'Попередження через голосового асистента'
              },
              {
                icon: 'blue-alarm',
                name: 'Сирена'
              }
            ]
          },
          {
            title: 'Трігер: Коротке замикання у електромережі',
            options: [
              {
                icon: 'blue-cross',
                name: 'Ізоляція ділянки замикання'
              },
              {
                icon: 'blue-bolt',
                name: 'Знеструмлення приладів'
              },
              {
                icon: 'blue-iphone',
                name: 'Повідомлення на ваш телефон'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги системи бездротового розумного будинку',
          text: 'Бездротовий розумний будинок - це нова ера в сфері розумних систем,  де комфорт, безпека та ' +
            'енергоефективність поєднуються в одному рішенні. Відкрийте для себе магію технологій без зайвих проводів і обмежень.',
          dropdownList: [
            {
              title: 'Швидка та легка інтеграція на будь-якому етапі',
              text: 'Система бездротового розумного будинку дозволяє здійснювати просту інсталяцію незалежно від типу при ' +
                'міщення, без зайвих дротів та шнурів, не потребуючи втручання у готовий ремонт будівлі, залишаючи стіни цілими.',
            },
            {
              title: 'Приваблива вартість',
              text: 'Порівняно з дротовими системами, бездротовий розумний будинок пропонує економічність завдяки меншій' +
                ' кількості необхідного обладнання та зменшеному обсягу робіт. Це дозволяє вам отримати передові технології без переплат. ',
            },
            {
              title: 'Легке інтегрування нових або додаткових елементів',
              text: 'Передові технології забезпечують швидке і просте інтегрування будь-яких нових пристроїв, дозволяючи ' +
                'розширювати функціонал вашого будинку та насолоджуватися останніми інноваціями у світі розумних пристроїв.',
            },
            {
              title: 'Керування без Інтернету',
              text: 'Керування без інтернету у бездротовому розумному будинку можливе завдяки локальним мережам і технологіям, ' +
                'що дозволяють пристроям безперебійно взаємодіяти один з одним.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Так скільки коштує?',
            text: 'На нашому сайті ви знайдете зручний калькулятор, який дозволяє приблизно розрахувати вартість для вашої ' +
              'конкретної ситуації. Однак кожен розумний будинок унікальний, тому точніше вам підкаже наш майстер під час ' +
              'безкоштовної консультації. Але ми впевнені, що ціна вас приємно здивує, адже розумний будинок це не так дорого, як всі звикли вважати!',
          },
          {
            title: 'Скільки часу займає встановлення?',
            text: '200+ наших клієнтів насолоджується розумним будинком вже через 3 дні після замовлення. Приєднуйтесь до' +
              ' ексклюзивної спільноти задоволених клієнтів всього в 3 кроки: 1. Подзвоніть нам для безкоштовної консультації ' +
              'та отримайте зрозумілі відповіді. 2. Отримайте рекомендації від нашого майстра при огляді об’єкту. 3. Довірте' +
              ' спеціалістам професійне встановлення та якісне налаштування всіх функцій системи.',
          },
          {
            title: 'Чи можу я розширити свою систему розумного будинку у майбутньому?',
            text: 'Так, система бездротового розумного будинку зроблена з урахуванням масштабованості. Ви зможете додавати ' +
              'нові пристрої, різні сценарії для ваших приладів та функціональні можливостів майбутньому.',
          },
          {
            title: 'Чи складно встановити розумний будинок?',
            text: 'Бездротова технологія значно спрощує процес встановлення, оскільки відсутні кабелі, які потребують складної ' +
              'прокладки. Ви зможете швидко насолоджуватися всіма перевагами розумного будинку без зайвих клопотів за короткий проміжок часу.',
          },
          {
            title: 'Які пристрої можна інтегрувати в розумний будинок?',
            text: 'Майже всі, що працюють, використовуючи електроенергію.',
          },
          {
            title: 'Чи можу я інтегрувати розумний будинок, не купуючи нову техніку?',
            text: 'В більшості випадків - так. Практично всі сучасні пристрої мають можливість під’єднання до бездротового ' +
              'розумного будинку, саме в цьому полягає перевага цієї системи. Проте умови бувають різні, наш майстер ' +
              'оцінить вашу ситуацію та дасть остаточну відповідь під час консультації.',
          },
          {
            title: 'Які можливості керування доступні для розумного будинку?',
            text: 'Ви зможете зручно керувати вашим розумним будинком через мобільний додаток на смартфоні або планшеті, а ' +
              'також за допомогою голосових помічників, що забезпечить комфорт у кожному куточку вашої оселі.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>