<template>
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestions :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="200"
    title="Розумне освітлення <span>під ключ</span>"
    text="Це інноваційний метод управління освітленням у вашому будинку."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystemSection from "~/components/indexSections/WirelessSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";

export default defineComponent({
  name: 'SmartLight',

  components: {
    HaveQuestions,
    WirelessSystem,
    WirelessSystemSection,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      template: {
        banner: {
          image: 'comfort-function-1',
          icon: 'white-light',
          title: 'Розумне освітлення',
          text: 'Це інноваційний метод управління освітленням у вашому будинку. Сучасні смарт LED-лампи обладнані спеціальним програмним забезпеченням, яке може бути інтегроване з програмами “розумних” домашніх асистентів та інших пристроїв. Це дозволяє автоматизувати освітлення та віддалено зручно управляти ним. Такий підхід — чудова альтернатива традиційним настінним вимикачам.',
          price: '200',
        },
        benefits: [
          {
            id: 1,
            title: 'Віддалене управління',
            text: 'Система освітлення розумного будинку дозволяє регулювати світло за допомогою віддалених технологій, таких як програми для смартфонів чи голосові команди. Вам не потрібно бути прив’язаним до будинку, керуйте зручно, де б не були.',
          },
          {
            id: 2,
            title: 'Автоматизація',
            text: 'Сучасне обладнання не лише автоматизує увімкнення та вимикання ламп у приміщеннях, але і забезпечує регулювання різноманітних параметрів їх роботи — від яскравості до кольору. Вибір параметрів широкий, усе залежить від настрою та потреб.',
          },
          {
            id: 3,
            title: 'Розмаїття сценаріїв роботи',
            text: 'Мешканці будинку з легкістю можуть вибрати оптимальні опції відповідно до уподобань та потреб. Наприклад: увімкнення світла за графіком, вимкнення ламп під час виходу з будинку, створення розслабляючої атмосфери та ін.',
          },
        ],
        functions: {
          image: 'smart-light',
          title: 'Можливості обладнання та функції',
          text: 'Система може створювати безліч сценаріїв, що надає можливість адаптувати світло згідно з обставинами та настроєм:',
          dropdownList: [
            {
              title: 'Опція "Вийшов – прийшов"',
              text: 'автоматичне вимкнення освітлення під час виходу з будинку та увімкнення при поверненні.',
            },
            {
              title: 'Автоматичне увімкнення',
              text: 'Автоматичне увімкнення розумного освітлення за допомогою датчиків.',
            },
            {
              title: 'Імітація присутності',
              text: 'Імітація присутності для запобігання крадіжок у випадку тривалої відсутності вдома.',
            },
            {
              title: 'Сценарій "Релакс"',
              text: 'система створює приглушене тепле світло та улюблену музику для створення приємної атмосфери ввечері.',
            },
            {
              title: 'Унікальна функція “Будильник”',
              text: 'за допомогою інноваційних LED ламп можна встановити режим, який вмикатиметься під час пробудження, імітуючи схід сонця.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається контроль освітлення',
          text: 'Пристрої, що входять до системи контролю освітлення. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'smart-light',
              title: 'Реле керування освітленням',
              text: 'Забезпечує автоматизацію керування світлом та ел. приладами.',
            },
            {
              image: 'smart-switch',
              title: 'Розумний вимикач',
              text: 'Можна керувати через додатки сумісні з екосистемою Aqara.',
            },
            {
              image: 'smart-light-bulb',
              title: 'Розумна лампочка',
              text: 'Керується віддалено, може змінювати колір та реагувати на рух.',
            },
            {
              image: 'rgb-tape',
              title: 'RGB стрічка',
              text: 'Монтується у необхідні зони приміщення і керується віддалено.',
            },
            {
              image: 'server',
              title: 'Сервер',
              text: 'Синхронізує роботу усих пристроїв розумного будинку.',
            }
          ]
        },
        choose: {
          icon: 'white-light',
          title: 'Система освітлення розумного будинку: як вибрати',
          text: 'Залежно від ваших потреб важливо підібрати відповідне обладнання. Також необхідно вирішити, з якими лампами буде взаємодіяти система: звичайними, ' +
            'LED стрічками, RGB-світлодіодами, світильниками з димерами та іншими. Вибір конкретного обладнання залежить від бажаних сценаріїв, їх кількості, а також ' +
            'особливостей будинку та квартири. Наші фахівці підберуть найкращий інноваційний варіант системи під ваші індивідуальні потреби.',
        },
        automations: [
          {
            title: 'Трігер: Ви лягаєте спати',
            options: [
              {
                icon: 'blue-moon',
                name: 'Дім переходить у режим “Ніч”'
              },
              {
                icon: 'blue-light',
                name: 'Вимикається усе освітлення у будинку'
              }
            ]
          },
          {
            title: 'Трігер: Ви хочете почитати книгу',
            options: [
              {
                icon: 'blue-microphone',
                name: 'Команда “Збільши яскравість освітлення”'
              },
              {
                icon: 'blue-light',
                name: 'Яскравість освітлення збільшилася у кімнаті, в якій ви знаходитеся'
              }
            ]
          },
          {
            title: 'Трігер: Ви знаходитеся на роботі і не впевнені, чи вимкнули світло вдома',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Ви відкриваєте мобільний додаток вашого розумного будинку'
              },
              {
                icon: 'blue-eye',
                name: 'Перевіряєте статус засобів освітлення'
              },
              {
                icon: 'blue-bolt',
                name: 'Вимикаєте світло'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Основні переваги системи',
          text: '“Розумне” освітлення надає безліч переваг та можливостей, серед яких варто виділити такі:',
          dropdownList: [
            {
              title: 'Ефективне використання електроенергії.',
              text: 'Сучасне обладнання включає широкий асортимент пристроїв, таких як рухові сенсори та таймери, що значно зменшує ' +
                'споживання електроенергії. Освітлення активується згідно з певними сценаріями, сприяючи раціональному використанню ресурсів.',
            },
            {
              title: 'Зручне керування з будь-якої точки світу.',
              text: 'Системи дозволяють дистанційно керувати ними через гаджет (смартфон або комп’ютер) за допомогою спеціального додатка.' +
                ' Це надає користувачеві зручність та можливість контролю освітлення навіть здалеку.',
            },
            {
              title: 'Розширені можливості налаштувань.',
              text: 'Технологія дозволяє легко змінювати яскравість світла та встановлювати автоматичне вимикання в певних ' +
                'приміщеннях. Це надає користувачам гнучкість у налаштуванні освітлення під індивідуальні потреби.',
            },
            {
              title: 'Миттєва зміна режиму.',
              text: 'Попередньо встановлені та налаштовані світлові сценарії створюють особливу атмосферу для будь-якого випадку, ' +
                'незалежно від того, чи обрали ви тепле, холодне біле світло чи різноколірне. Все, що потрібно зробити, — це натиснути на кнопку.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Якщо в мене вже є ремонт, чи можу я налаштувати розумне освітлення?',
            text: "Так, звичайно. Для цього в кожний вимикач ми інтегруємо розумні реле, які з'єднуємо між собою по Zigbee зв'язку.",
          },
          {
            title: 'Якщо в мене наразі йде ремонт, на якому етапі краще робити освітлення?',
            text: 'На етапі прокладання електрики. Для зручності керування та можливості легкої інтеграції нових функцій у майбутньому на цьому ' +
              'етапі ми встановлюємо слаботочний щиток. В ньому будуть знаходитись всі розумні реле та контролери.',
          },
          {
            title: 'Ви можете зробити розумним тільки верхнє світло чи підсвітки також?',
            text: 'Ми також робимо розумними підсвітки. Ви зможете змінювати яскравість та колір підсвіток або зробити автоматизовані сценарії з ними.',
          },
          {
            title: 'Що таке слаботочний щиток?',
            text: 'Слаботочний щиток – це змонтований пластиковий бокс, який використовується для керування всіма пристроями розумного ' +
              'будинку з одного місця. Якщо відразу встановити слаботочний щиток, це дасть змогу в майбутньому легко додавати нові розумні пристрої до єдиної системи.',
          },
          {
            title: 'Як прорахувати ціну на все освітлення в будинку?',
            text: 'Ми зробимо точний прорахунок після виїзної консультації та вашого детального спілкування з нашими майстрами. ' +
              'Вони дізнаються всі Ваші побажання по кожній групі освітлення. Якщо у Вас зараз етап ремонту, для точного прорахунку нам також бажано бачити дизайн-проєкт.',
          },
        ]
      }
    }
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>