<template>
  <Loader v-if="loading" />
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestions :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="420"
    title="Розумна Протипожежна система <span>під ключ</span>"
    text="Забезпечує надійний захист від можливого виникнення пожежі шляхом раннього виявлення, сповіщення та вжиття необхідних заходів для зменшення ризику."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'SmartHeating',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'comfort-function-2',
          icon: 'white-heating',
          title: 'Розумне опалення',
          text: 'Це сучасний інноваційний підхід, що включає комплекс спеціального обладнання та датчиків. Система дозволяє ефективно налаштовувати процес обігріву приватних будинків, квартир або дачі, сприяючи підвищенню рівня комфорту для мешканців через створення оптимальних температурних умов в кожному окремому приміщенні.',
          price: '340',
          service: 'Функції комфорту'
        },
        benefits: [
          {
            id: 1,
            title: 'Безпека',
            text: ' Усе обладнання безпечне та у разі виникнення аварійної ситуації — спрацюють датчики, система спробує розв\'язати проблему самостійно або попередити її, а якщо не вдасться — автоматично вимкне обладнання та знеструмить його. Крім цього, “розумний” будинок повідомить вас про це.',
          },
          {
            id: 2,
            title: 'Комфорт',
            text: 'Під час зниження температури нижче встановленого діапазону (23-25 градусів), система автоматично активує опалення, а при підвищенні – охолодження повітря. У будь-яку пору року обладнання здатне обігрівати або охолоджувати кімнату відповідно до ваших потреб.',
          },
          {
            id: 3,
            title: 'Віддалене керування',
            text: 'Налаштовувати різноманітні режими та стежити за роботою обладнання можна будь-де. Більше не потрібно вручну регулювати температуру кімнат — зробіть це у декілька кліків на вашому смартфоні.',
          },
        ],
        functions: {
          image: 'smart-heating',
          title: 'Унікальні функції розумного опалення',
          text: 'Система здатна безпечно працювати в автоматичному режимі та забезпечувати у всіх кімнатах оптимальну температуру.',
          dropdownList: [
            {
              title: 'Незалежна терморегуляція окремих приміщень',
              text: 'В кожній кімнаті: комора, дитяча кімната, кухня, кабінет і спальня, може бути встановлений індивідуальний температурний поріг для забезпечення максимального комфорту, враховуючи його призначення.',
            },
            {
              title: 'Термоконтроль в приміщеннях залежно від пори року та часу доби',
              text: 'Система одночасно відстежує температуру як всередині приміщення, так і за його межами, створюючи сприятливі температурні умови всередині будинку.',
            },
            {
              title: 'Відстеження та регуляція температури',
              text: 'Регулювання опалювального обладнання, такого як включення/вимкнення теплої підлоги та радіаторів, може здійснюватися як вручну, так і автоматично за допомогою вбудованих температурних датчиків відповідно до встановлених сценаріїв.',
            },
            {
              title: 'Миттєве реагування на надзвичайні ситуації',
              text: 'У випадку порушення цілісності труб, відмови модулів системи опалення або поломки електричного нагрівального кабелю (теплої підлоги), система автоматично відключає їх (знеструмлює). Водночас “Розумний будинок” сповістить вас про аварійну ситуацію.',
            },
            {
              title: 'Управління кліматом цілий рік',
              text: 'Ви можете увімкнути обладнання та будь-які прилади протягом року у будь-яку погоду.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається система керування опаленням',
          text: 'Пристрої, що входять до системи керування опаленням. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'smart-heating',
              title: `Термостат радіаторів <br> опалення`,
              text: 'Забезпечує автоматизацію керування світлом та ел. приладами.',
            },
            {
              image: 'temperature-sensor',
              title: 'Датчик температури',
              text: 'Слідкує за загальною температурою повітря у приміщенні..',
            },
            {
              image: 'underfloor-heating-thermostat',
              title: 'Термостат теплої підлоги',
              text: 'Дозволяє налаштовувати роботу теплої підлоги.',
            },
            {
              image: 'server',
              title: 'Сервер',
              text: 'Синхронізує роботу усіх пристроїв розумного будинку.',
            }
          ]
        },
        choose: {
          icon: 'white-heating',
          title: 'Система розумного опалення: як вибрати',
          text: 'Найкращим рішенням буде — звернутися до фахівців. Вони зможуть оглянути квартиру чи будинок та проаналізувати вашу індивідуальну ситуацію. Залежно від особливостей приладів та планування житла — спеціалісти підберуть оптимальну модель обладнання та розроблять план робіт зі встановлення. Наша компанія пропонує вам такі послуги від кваліфікованих фахівців за розумну ціну.',
        },
        automations: [
          {
            title: 'Трігер: Взимку температура у будинку підвищилася до некомфортно високого рівня (показник обирається користувачем індивідуально)',
            options: [
              {
                icon: 'blue-heating',
                name: 'Опалення переходить у режим енергозберігання'
              },
              {
                icon: 'blue-light',
                name: 'Вентиляція посилює подачу свіжого повітря'
              }
            ]
          },
          {
            title: 'Трігер: Ви лягаєте спати',
            options: [
              {
                icon: 'blue-temperature',
                name: 'Зниження температури до обраного рівня через 30 хвилин після засинання (налаштовується індивідуально)'
              },
              {
                icon: 'blue-blinds',
                name: 'Закриття ролетів'
              }
            ]
          },
          {
            title: 'Трігер: Дуже холодна погода',
            options: [
              {
                icon: 'blue-heating',
                name: 'Опалення підтримує необхідну температуру'
              },
              {
                icon: 'blue-eye',
                name: 'Кліматична установка зволожує повітря запобігаючи надмірної сухості'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги системи “розумного” опалення',
          text: 'Обладнання надає безліч можливостей, які дозволяють зручно керувати температурою у приміщеннях. “Розумне” опалення має такі переваги:',
          dropdownList: [
            {
              title: 'Автоматичне охолодження та обігрів житла.',
              text: 'Система смартбудинку охолоджує житло, коли вас немає вдома, а також прогріває його незадовго до приїзду сім’ї до вказаних позначок.' +
                ' Крім того, ви можете налаштовувати температурний режим, коли знаходитесь поза будинком. Це значно підвищує ваш комфорт. Повертаючись додому — відчуваєте тепло та затишок.',
            },
            {
              title: 'Економія електроенергії та комфорт.',
              text: 'При налаштуванні температурного режиму в межах 23–25 градусів, система самостійно активує обігрів під час зниження температури ' +
                'та вмикає охолодження у разі підвищення. Це не лише забезпечує комфорт в будинку, але також сприяє раціональному використанню енергоносіїв,' +
                ' таких як природний газ і електроенергія, що в результаті дає можливість економити на комунальних платежах.',
            },
            {
              title: 'Зручне керування температурою.',
              text: '“Розумне” опалення дозволяє налаштовувати різний температурний режим залежно від потреб кожного члена сім’ї. Це дозволяє адаптувати систему під' +
                ' особисті уподобання та насолоджуватися приємною атмосферою у кімнаті. У результаті, будь-яке приміщення можна обігрівати чи охолоджувати як забажаєте.',
            },
            {
              title: 'Дистанційне управління.',
              text: 'Системою можна комфортно керувати з будь-якої точки світу за допомогою гаджету: персонального комп\'ютера, смартфона чи планшета.' +
                ' Ви не прив’язані до будинку та маєте можливість спокійно подорожувати, швидко та зручно встановлюючи потрібні параметри обладнання.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Чи можете ви зробити розумними радіатори в квартирі?',
            text: "Так, звичайно. Ми встановлюємо розумні термоголовки та інтегруємо їх в єдину систему розумного будинку, щоб Ви могли керувати температурою у Вашій оселі.",
          },
          {
            title: 'Чи можете ви зробити розумною теплу підлогу?',
            text: 'Так, звичайно, ми можемо автоматизувати теплу підлогу та зробити її керування зручним – з телефону.',
          },
          {
            title: 'Я можу керувати опаленням віддалено?',
            text: 'Так, це дасть змогу заощадити Вам кошти на комунальних витратах. Якщо Ви поїхали у далеку подорож – віддалено зменшіть температуру в приміщенні.',
          },
          {
            title: 'Ви зможете зробити розумним котел?',
            text: 'Так, ми робимо розумним котел, встановлюючи до нього датчики, які дадуть Вам змогу регулювати температуру з телефону.',
          },
          {
            title: 'Як прорахувати ціну на опалення?',
            text: 'Для цього потрібно запросити до себе на консультацію наших майстрів. Вони оглянуть об\'єкт та дізнаються Ваші побажання, після' +
              ' чого Ви отримаєте детальний прорахунок. Якщо наразі у Вас ремонт, нам також потрібно побачити дизайн-проєкт.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>