<template>
  <Loader v-if="loading" />
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestionsSection :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="190"
    title="Розумний домофон <span>під ключ</span>"
    text="Ви завжди будете бачити, хто до вас завітав, зможете дистанційно відчинити двері та прийняти посилку від кур’єра чи впустити гостей."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'SmartIntercom',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'security-function-6',
          icon: 'white-intercom',
          title: '«Розумний» домофон',
          text: 'Ви завжди будете бачити, хто до вас завітав, зможете дистанційно відчинити двері та прийняти посилку ' +
            'від кур’єра чи впустити гостей, які прийшли раніше ніж домовлялись. І це далеко не всі можливості «розумного» домофона.',
          price: '190',
          service: 'Функції безпеки'
        },
        benefits: [
          {
            id: 1,
            title: 'Захист',
            text: 'Наявність інтегрованого в систему розумного будинку домофона забезпечує абсолютний контроль за тим,' +
              ' хто заходить і виходить, у який час та що при цьому робить. Небажані гості одразу будуть помічені.',
          },
          {
            id: 2,
            title: 'Економія та безпека',
            text: 'Цей прилад стане запорукою раннього виявлення сторонніх або підозрілих осіб, які намагаються потрапити ' +
              'в будинок. Інша сторона – якщо хтось із домашніх забув ключ, вдасться відчинити йому двері.',
          },
          {
            id: 3,
            title: 'Віддалене керування',
            text: 'Домофон в «розумному» будинку дозволяє побачити, хто прийшов, і прийняти рішення щодо того, пускати ' +
              'його в дім чи ні. До того ж самі собі зможете відімкнути двері, якщо, наприклад, руки зайняті покупками.',
          },
        ],
        functions: {
          image: 'smart-intercom',
          title: 'Можливості розумного домофона',
          text: 'Домофон у «розумному будинку» – це важлива частина системи безпеки та відеоспостереження, яка надає доволі значні можливості для власників.',
          dropdownList: [
            {
              title: 'Запобігання проникненню',
              text: 'Виявлення відвідувачів, та навіть знімання їх чи фотографування цілком вірогідно відіб’ють їм бажання вчиняти протиправні дії, якщо такі наміри були.',
            },
            {
              title: 'Керування з телефона',
              text: 'Неважливо, де ви знаходитесь, зможете поспілкуватися з тим, хто дзвонить у двері, навіть впустити його в дім або ж отримати посилку, якщо завітав кур’єр.',
            },
            {
              title: 'Обмеження можливості відчинити замок',
              text: ' Особливо актуально, коли ваша дитина залишається вдома. Через застосунок керуватимете всіма дзвінками у двері. Перед тим як відчинити їх, зможете поглянути, хто прийшов.',
            },
            {
              title: 'Отримувати сповіщення',
              text: 'Якщо смартфон певний час поза мережею. Про те, що хтось приходив, так чи інакше дізнаєтесь.',
            },
            {
              title: 'Відкривати двері безпосередньо через застосунок',
              text: 'Якщо прийшли гості чи дитина забула вдома ключі. Насправді виникає багато варіантів, чому може знадобитись віддалено відчинити двері.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається розумний домофон',
          text: 'Пристрої, що входять до системи відеоспостереження. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'smart-intercom',
              title: 'Розумний відеодзвінок',
              text: 'Дає змогу віддалено спілкуватися з гостями і транслювати відео.',
            },
            {
              image: 'control-center',
              title: 'Центр керування',
              text: 'Хаб, що повʼязує усю екосистему і через який керується увесь будинок.',
            }
          ]
        },
        choose: {
          icon: 'white-intercom',
          title: 'Як правильно вибрати «розумний» домофон',
          text: 'Насамперед варто зважати на власні потреби користування та специфічні вимоги, якщо вони є. Такий підхід ' +
            'суттєво зменшить ризики для безпеки вас та ваших близьких. Ми пропонуємо індивідуальний підхід до кожного ' +
            'клієнта, тому допомагаємо з правильним вибором всіх елементів системи.',
        },
        automations: [
          {
            title: 'Трігер: Дзвінок у домофон',
            options: [
              {
                icon: 'blue-camera',
                name: 'Ви бачите вашого гостя у камеру'
              },
              {
                icon: 'blue-voice',
                name: 'Віддалено спілкуєтеся з ним'
              },
              {
                icon: 'blue-lock',
                name: 'Відчиняєте ворота'
              }
            ]
          },
          {
            title: 'Трігер: Ви повертаєтеся з магазину з повними руками пакетів',
            options: [
              {
                icon: 'blue-microphone',
                name: 'Використовуючи голосове керування кажете домофону: “Відкрий двері”'
              },
              {
                icon: 'blue-lock',
                name: 'Якщо ви авторизований резидент, розумний будинок відкриє двері '
              }
            ]
          },
          {
            title: 'Трігер: Вам треба подивитися хто і о котрій годині заходив у оселю',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Заходите у додаток'
              },
              {
                icon: 'blue-eye',
                name: 'Переглядаєте історію входів та виходів з оселі за поточний день'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги «розумний» домофонів',
          text: 'Бездротовий «розумний» домофон – це нова ера у сфері смартбудинків. Вони ефективно поєднують у собі ' +
            'великий функціонал, який буде доступний вам, якщо вирішите використати його. Все встановлення займає ' +
            'зовсім мало часу – без дротів і будь-яких інших складних монтажних робіт.',
          dropdownList: [
            {
              title: 'Проста інтеграція.',
              text: 'Цей прилад стане частиною загального простору, який дозволяє створити значно безпечніше та комфортніше' +
                ' оточення. Внаслідок цього зможете контролювати, хто та коли приходить до вашого будинку.',
            },
            {
              title: 'Безпека та збільшення потужності системи відеоспостереження.',
              text: 'Всі жителі, які мають доступ до «розумного» домофона, зможуть контролювати, хто потрапляє всередину. ' +
                'Використання таких пристроїв у багатоквартирних будинках дозволить уникнути пошкоджень у під’їздах.',
            },
            {
              title: 'Віддалений доступ, незалежно від місця перебування.',
              text: 'Можете як слідкувати в режимі реального часу, так і переглядати записи, фото.',
            },
            {
              title: 'Економія часу.',
              text: 'Особливо актуально, коли у вас великий дім (до дверей зовсім можете не підходити, щоб подивитись, ' +
                'хто прийшов, і вирішити, відчиняти чи ні).',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Яка вартість встановлення «розумного» домофона?',
            text: 'Ціна залежатиме від обраної модифікації, тобто від того, які бажаєте отримати функції. Надаємо ' +
              'консультацію та допомагаємо підібрати краще рішення для вашого дому.',
          },
          {
            title: 'Чи надійний «розумний» домофон?',
            text: 'Так, ця система гарантує безпеку вашого майна та жителів будинку. Ви самі контролюєте, кому та коли ' +
              'відчиняти двері. Такий прилад зручний у використанні, не потребує якихось особливих навичок.',
          },
          {
            title: 'Який функціонал буде доступний при використанні «розумного» домофона?',
            text: 'Ви зможете переглядати відео, робити фото відвідувачів, які дзвонили. Крім того, матимете доступ до ' +
              'віддаленого відмикання чи, навпаки, блокування замка.',
          },
          {
            title: 'Які монтажні роботи проводитимуться при встановленні «розумного» домофона?',
            text: 'Жодних дротів, штроблення стін чи інших втручань ваша домівка не матиме – система безпровідна, ' +
              'встановлюється максимально швидко. Вам не треба буде нічого після цього робити – просто користуйтеся.',
          },
          {
            title: 'Які можливості керування «розумним» приладом я матиму?',
            text: 'Монтаж розумного домофона відкриває для вас значні можливості, насамперед дистанційного керування ' +
              'відмиканням та замиканням замків. Тепер ви не турбуватиметесь про те, чи не забули замкнути житло.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>