<template>
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestions :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="90"
    title="Розумна Протипожежна система <span>під ключ</span>"
    text="Забезпечує надійний захист від можливого виникнення пожежі шляхом раннього виявлення, сповіщення та вжиття необхідних заходів для зменшення ризику."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystemSection from "~/components/indexSections/WirelessSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";

export default defineComponent({
  name: 'Smart Lock',

  components: {
    HaveQuestions,
    WirelessSystem,
    WirelessSystemSection,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      template: {
        banner: {
          image: 'security-function-4',
          icon: 'white-lock',
          title: 'Монтаж «розумного» замка під ключ',
          text: '«Розумний» замок дає надійний захист від проникнення сторонніх осіб та запобігає ситуаціям, коли вам довелося б звертатись до професійних зломників. Ви повністю контролюєте відмикання та замикання, навіть дистанційно.',
          price: '90',
        },
        benefits: [
          {
            id: 1,
            title: 'Безпека',
            text: 'Лише ви вирішуєте, відчиняти двері чи ні. Більшість злодіїв, побачивши подібну систему, не будуть намагатись зламати її, а коли навіть спробують це зробити, то отримають чималі проблеми.',
          },
          {
            id: 2,
            title: 'Економія',
            text: 'Використання такого замку в комбінації з домофоном та іншими захисними елементами «розумного» будинку зробить його дійсно неприступною фортецею, а це означає, що не виникатиме посягань на ваше майно.',
          },
          {
            id: 3,
            title: 'Віддалене керування',
            text: 'Відчинити чи перевірити замкненість можна віддалено: лише пара кліків – і можете не турбуватись про те, що гості чекають на порозі, а ви затримуєтесь, чи про те, що забули зачинити двері.',
          },
        ],
        functions: {
          image: 'fire-detector-illustration',
          title: 'Можливості «розумного» замка',
          text: 'Встановлення «розумного» замка – це не просто монтаж у дверне полотно, а ще й підключення до загальної системи. У такому разі отримаєте чималі можливості.',
          dropdownList: [
            {
              title: 'Контроль доступу',
              text: 'Обмеження або дозвіл входу в житло чи навіть в окрему кімнату. Рішення про це приймати лише вам. Причому для цього не треба бути вдома, все вдасться зробити в пару кліків, у застосунку.',
            },
            {
              title: 'Запобігання проникненню',
              text: 'Злодії, зрозумівши, що вони наткнулись на «розумну» систему, навряд чи захочуть зламати її. Навіть якщо зроблять це, то їх відразу зафіксує камера.',
            },
            {
              title: 'Інтегрованість',
              text: 'Комбінація «розумного» замка з іншими елементами системи – це дуже зручне рішення. Воно відкриває нові можливості для створення сценаріїв використання та дає шанс зробити своє середовище комфортнішим та безпечнішим.',
            },
            {
              title: 'Вільний доступ для близьких та заборона входу для сторонніх',
              text: 'Уявіть собі: ваша дитина залишилась вдома, а у двері подзвонили невідомі. Можна запобігти відкриванню замків. Для цього достатньо здійснити прості дії в застосунку смартфона. Ваша дитина в безпеці, а отже, немає підстав для зайвих хвилювань.',
            },
            {
              title: 'Фіксація',
              text: 'Замок працює зазвичай у тандемі з домофоном, тому зловмисник буде сфотографований чи навіть знятий на відео. У такому разі відповідальності не уникнути.',
            },
          ]
        },
        equipment: [
          {
            image: 'wireless-system-image',
            title: 'Детектор пожежі',
            text: 'Бездротовий пожежний датчик тепла, диму та чадного газу.',
          },
          {
            image: 'wireless-system-image',
            title: 'Тривожна кнопка',
            text: 'Бездротова настінна кнопка для активації пожежної тривоги вручну.',
          },
          {
            image: 'wireless-system-image',
            title: 'Хаб',
            text: 'Централь з підтримкою бездротових пристроїв.',
          },
          {
            image: 'wireless-system-image',
            title: 'Система автогасіння',
            text: 'Автономний, автоматичний модуль порошкового полумʼягасіння.',
          }
        ],
        choose: {
          image: 'wireless-system-image',
          title: 'Як правильно вибрати «розумний» замок',
          text: 'У «розумний» будинок дверний замок потрібно вибирати, враховуючи особливості конкретної системи: її потужність, використані компоненти, ' +
            'призначення. Необхідна перевірка відповідності стандартам безпеки, зазвичай виконується індивідуальний розрахунок, здійснюється розробка системи, сценаріїв.',
        },
        automations: [
          {
            title: 'Трігер: Датчик ідентифікує ненавмисний спалах вогню',
            options: [
              {
                icon: 'blue-bag',
                name: 'Активація датчику пожежогасіння в зоні виявлення'
              },
              {
                icon: 'blue-bag',
                name: 'Сирена'
              },
              {
                icon: 'blue-bag',
                name: 'Виклик пожежної безпеки'
              },
              {
                icon: 'blue-bag',
                name: 'Вимкнення усіх електроприладів'
              }
            ]
          },
          {
            title: 'Трігер: Велика концентрація диму та вуглекислого газу у кімнаті',
            options: [
              {
                icon: 'blue-bag',
                name: 'Сирена'
              },
              {
                icon: 'blue-bag',
                name: 'Виклик пожежної безпеки'
              },
              {
                icon: 'blue-bag',
                name: 'Повідомлення на ваш телефон'
              }
            ]
          },
          {
            title: 'Трігер: Коротке замикання у електромережі',
            options: [
              {
                icon: 'blue-bag',
                name: 'Ізоляція ділянки замикання'
              },
              {
                icon: 'blue-bag',
                name: 'Знеструмлення приладів'
              },
              {
                icon: 'blue-bag',
                name: 'Повідомлення на ваш телефон'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги «розумного» замка',
          text: 'Бездротова система передбачає необхідність тривалого встановлення «розумного» замка – все монтується за бездротовою технологією. Це має чимало ' +
            'переваг, які можете оцінити прямо зараз.',
          dropdownList: [
            {
              title: 'Повний контроль та необмежені можливості керування',
              text: 'Можна управляти відкриванням та закриванням дверей із будь-якої точки світу. Це дозволить вберегти ваших рідних та близьких від неприємностей, а також захистити матеріальні цінності.',
            },
            {
              title: 'Отримання доставки, навіть коли не вдома',
              text: 'Наприклад, можна «впустити» кур’єра та отримати бажану посилку.',
            },
            {
              title: 'Відмикання для себе та автоматичне замикання (якщо підійшли до дому, а руки зайняті, або розумієте, що забули/загубили ключ)',
              text: 'Для замикання потрібно лишень встановити умову, за якої це відбувається.',
            },
            {
              title: 'Підвищений рівень безпеки',
              text: 'Зараз є злодії, які здатні зламати такі пристрої. А якщо вони навіть це вміють, то, найімовірніше, розуміють, яку несе в собі небезпеку проникнення до «розумного будинку» з величезною кількістю безпекових елементів та автоматичним викликом служби охорони.',
            },
          ]
        },
        haveQuestions: [
          {
            title: '«Розумний» замок – це надійно?',
            text: 'Звичайно, «розумний» замок надійний та комфортний у використанні. З його допомогою Ви зможете почувати себе в безпеці та зручно користуватися ним.',
          },
          {
            title: 'Я зможу самостійно вибирати, як саме відкривати його?',
            text: 'Так, Ви зможете налаштувати замок під свої потреби. Зазвичай клієнти використовують ключ у телефоні, відбиток пальця або пароль.',
          },
          {
            title: 'Я зможу віддалено відкривати та закривати замок?',
            text: 'Так, «розумні» замки мають можливість віддаленого керування. Завдяки цьому Ви можете впустити гостя в приміщення, навіть якщо Вас немає вдома, або віддалено закрити замок, коли йдете з оселі.',
          },
          {
            title: 'Який замок рекомендуєте?',
            text: 'Зазвичай ми рекомендуємо «розумні» замки від Aqara. Вони мають широкий набір інтелектуальних функцій та є надійними у використанні.',
          },
          {
            title: 'Яка вартість?',
            text: 'Ціна купівлі «розумного» замка залежить від виробника обладнання та вибраної моделі. Діапазон – від 150 до 500 $. Окремо сплачуються роботи майстра, вартість яких залежить від складності монтажу.',
          },
          {
            title: 'Ви зможете поставити замок у мої двері або потрібно купляти нові двері?',
            text: 'Однозначну відповідь на це питання дасть майстер після огляду Вашого випадку. На жаль, не у всі двері є можливість інтегрувати «розумний» замок.',
          },
        ]
      }
    }
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>