<template>
  <Loader v-if="loading" />
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestions :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="150"
    title="Розумна Система відеоспостереження <span>під ключ</span>"
    text="Ви завжди будете в курсі, що відбувається біля вашої домівки й не пропустите абсолютно нічого."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystemSection from "~/components/indexSections/WirelessSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'VideoSurveillance',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    WirelessSystemSection,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'security-function-5',
          icon: 'white-camera',
          title: 'Система відеоспостереження',
          text: 'Система відеоспостереження – це запорука безпеки та контролю. Ви завжди будете в курсі, що відбувається біля вашої домівки й не пропустите абсолютно нічого. Вибирайте комплектацію та можливості.',
          price: '150',
        },
        benefits: [
          {
            id: 1,
            title: 'Захист',
            text: 'Територія, яку ви самі визначите, буде під пильним наглядом камер. Якщо відбуватиметься щось підозріле, реакція систем миттєва – повідомлення на телефон власника або навіть виклик охорони.',
          },
          {
            id: 2,
            title: 'Безпека',
            text: 'Ваше майно та домівка під контролем – виникнення будь-яких надзвичайних ситуацій не застигне вас зненацька. Система «розумного будинку» з відеоспостереженням дозволить суттєво зменшити, а то й зовсім уникнути матеріальних збитків.',
          },
          {
            id: 3,
            title: 'Віддалене керування',
            text: 'Системою зможете управляти та переглядати записи з камер безпосередньо зі смартфона, незалежно від точки країни чи світу, де ви знаходитесь. До того ж відеоспостереження можна інтегрувати з іншими системами «розумного будинку».',
          },
        ],
        functions: {
          image: 'video-surveillance',
          title: 'Можливості системи відеонагляду',
          text: '«Розумний будинок» або будь-яка інша територія чи об’єкт із відеоспостереженням оснащуються спеціальним обладнанням. Його комплектація, тип та кількість залежать від вимог до системи. Її використання дає чимало можливостей.',
          dropdownList: [
            {
              title: 'Запобігання проникненню',
              text: 'У разі протиправних дій у тандемі з системою відеоспостереження розумного будинку спрацює також сигналізація та буде викликаний наряд охорони.',
            },
            {
              title: 'Керування та контроль зі смартфона',
              text: 'Все, що відбувається, зможете спостерігати в режимі реального часу або ж при необхідності переглянути запис.',
            },
            {
              title: 'Відстеження відвідувачів',
              text: 'Дослідіть, хто приходив і як поводив себе біля ваших дверей. Це допоможе ідентифікувати, а в разі потреби притягнути до відповідальності хуліганів.',
            },
            {
              title: 'Інтеграція з іншими системами',
              text: 'Підключення та компонування з іншими елементами «розумного будинку» – не проблема, до того ж розширення можна зробити в будь-який момент.',
            },
            {
              title: 'Завжди в курсі',
              text: 'и можете отримувати повідомлення в разі виникнення тих чи інших ситуацій з описом. А також маєте змогу надавати мультидоступ до камер декільком користувачам.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається система відеоспостереження',
          text: 'Пристрої, що входять до системи відеоспостереження. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'motion-detector',
              title: 'Датчик руху',
              text: 'Реагує на рух людини і активує різні події при спрацьовуванні.',
            },
            {
              image: 'video-surveillance',
              title: 'Камера',
              text: 'Транслює відео на ваш смартфон чи монітор. Має нічне бачення.',
            },
            {
              image: 'control-center',
              title: 'Центр керування',
              text: 'Хаб, що повʼязує усю екосистему і через який керується увесь будинок.',
            }
          ]
        },
        choose: {
          icon: 'white-camera',
          title: 'Як правильно вибрати систему відеоспостереження',
          text: 'Монтаж систем відеоспостереження має чимало переваг, однак лише за умови правильного її вибору. Варто звертати увагу на кількість та тип обладнання, ' +
            'складність системи та можливість реалізації її на тій чи іншій ділянці, необхідність розробки нових сценаріїв. На вибір впливає те, який саме об’єкт плануєте підключити.',
        },
        automations: [
          {
            title: 'Трігер: Хтось сторонній проник на ваше подвірʼя чи в оселю',
            options: [
              {
                icon: 'blue-camera',
                name: 'Фото та відеофіксація порушника'
              },
              {
                icon: 'blue-alarm',
                name: 'Сирена'
              },
              {
                icon: 'blue-iphone',
                name: 'Повідомлення з фото обличчя порушника на ваш телефон'
              }
            ]
          },
          {
            title: 'Трігер: Вам треба переглянути осіб, що знаходилися біля вашої оселі протягом дня',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Заходите у додаток'
              },
              {
                icon: 'blue-eye',
                name: 'Переглядаєте запис з камер за поточний день'
              }
            ]
          },
          {
            title: 'Трігер: Вам треба тимчасово поставити на паузу усю систему відеоспостереження',
            options: [
              {
                icon: 'blue-iphone',
                name: 'Заходите у додаток'
              },
              {
                icon: 'blue-shield',
                name: 'Вмикаєте приватний режим'
              },
              {
                icon: 'blue-bolt',
                name: 'Уся система відеоспостереження тимчасово вимкнена'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги системи відеоспостереження для «розумного будинку»',
          text: 'Система відеоспостереження в «розумному будинку» дозволяє робити запис всього, що відбувається навколо або/та в домі. Це дає змогу помітити та притягнути ' +
            'до відповідальності злочинців. Крім того, доведено, що таке рішення є доволі ефективним методом охорони, адже злодії, побачивши камери, ' +
            'декілька разів подумають, перед тим як намагатимуться щось поцупити.',
          dropdownList: [
            {
              title: 'Зручність',
              text: 'Вдається спостерігати за тим, що відбувається на території біля дому, незалежно від того, де перебуваєте. Доступ до камер цілодобовий у будь-якій точці світу',
            },
            {
              title: 'Універсальність',
              text: 'Всі пристрої відеоспостереження вдається об’єднати в єдину систему (які це саме будуть виробники, не має значення). Ми пропонуємо лише перевірену продукцію від відомих брендів, яка справлятиметься з поставленими задачами на відмінно',
            },
            {
              title: 'Ідентифікація',
              text: 'Доступна установка з модулем розпізнавання автономерів та інтеграції з пропускною системою, у тому числі з відкриванням шлагбаумів тим людям, яким дозволений в’їзд',
            },
            {
              title: 'Проста інтеграція',
              text: 'Створення сценаріїв функціонування камер з іншими датчиками та пристроями системи, що значно спрощує життя власникам будинку.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Скільки камер ви встановлюєте?',
            text: 'Зазвичай клієнтам достатньо однієї камери, але якщо Ви бажаєте більше, то ми можемо це реалізувати.',
          },
          {
            title: 'Камери яких виробників ви встановлюєте?',
            text: 'Зазвичай ми рекомендуємо камери Ring, але також встановлюємо обладнання компаній Reolink, Tuya Smart, Xiaomi.',
          },
          {
            title: 'Чи зможу я через камеру спілкуватися з людиною, яка знаходиться за вхідними дверима?',
            text: 'Так, камери, які ми встановлюємо, мають мікрофон для спілкування з людьми по іншу сторону двері.',
          },
          {
            title: 'Камера записує матеріал чи тільки знімає в режимі реального часу?',
            text: 'Камера зберігає матеріал та відправляє його на хмару, де надалі Ви зможете його знайти.',
          },
          {
            title: 'Як довго зберігається записаний матеріал?',
            text: 'Це Ви можете визначити самостійно, вибравши в налаштуваннях бажаний час зберігання.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>