<template>
  <Loader v-if="loading" />
  <Banner :section="template.banner" />
  <Benefits :section="template.benefits" />
  <Functions :section="template.functions" />
  <ProductsSection />
  <Equipment :section="template.equipment" />
  <Choose :section="template.choose" />
  <Automations :section="template.automations" />
  <WirelessSystem :section="template.wirelessSystem" />
  <EcoSystem />
  <HaveQuestionsSection :section="template.haveQuestions" />
  <BuildSystemSection
    subtitle=""
    price="210"
    title="Голосове управління <span>під ключ</span>"
    text="Потурбуйтеся про повну зручність та контрольованість процесів у вашому домі."
  />
</template>

<script>
import {defineComponent} from 'vue'
import Banner from "~/components/serviceDetails/Banner.vue";
import Benefits from "~/components/serviceDetails/Benefits.vue";
import Functions from "~/components/serviceDetails/Functions.vue";
import ProductsSection from "~/components/indexSections/ProductsSection.vue";
import Equipment from "~/components/serviceDetails/Equipment.vue";
import Choose from "~/components/serviceDetails/Choose.vue";
import Automations from "~/components/serviceDetails/Automations.vue";
import EcoSystem from "~/components/serviceDetails/EcoSystem.vue";
import HaveQuestionsSection from "~/components/indexSections/HaveQuestionsSection.vue";
import BuildSystemSection from "~/components/indexSections/BuildSystemSection.vue";
import WirelessSystem from "~/components/serviceDetails/WirelessSystem.vue";
import HaveQuestions from "~/components/serviceDetails/HaveQuestions.vue";
import Loader from "~/UI/Loader.vue";

export default defineComponent({
  name: 'VoiceControl',

  components: {
    Loader,
    HaveQuestions,
    WirelessSystem,
    BuildSystemSection,
    HaveQuestionsSection,
    EcoSystem,
    Automations,
    Choose,
    Equipment,
    ProductsSection,
    Functions,
    Benefits,
    Banner
  },

  data() {
    return {
      loading: true,
      template: {
        banner: {
          image: 'comfort-function-8',
          icon: 'white-micro',
          title: 'Голосове управління',
          text: 'Потурбуйтеся про повну зручність та контрольованість процесів у вашому домі: вмикайте світло, зачиняйте чи відчиняйте штори, впускайте гостей у дім, не відриваючись від своїх справ. І це лише невелика частина можливостей голосового управління.',
          price: '210',
          service: 'Функції комфорту'
        },
        benefits: [
          {
            id: 1,
            title: 'Впевненість',
            text: 'Голосове керування забезпечує контроль над всіма інженерними системами в будинку – одразу дізнаватиметесь про будь-які проблеми з функціонуванням комунікацій та систем.',
          },
          {
            id: 2,
            title: 'Все під контролем',
            text: 'Вмикайте музику, створюйте затінення чи відкривайте штори, керуйте компонентами безпеки, регулюйте освітленість та виконуйте будь-які інші дії, знаходячись будь-де.',
          },
          {
            id: 3,
            title: 'Сценарії',
            text: 'Коли лягаєте спати або ж хочете почитати книгу, у такому разі додаткові команди голосом давати не доведеться. Налаштування сценаріїв можливе на ваш розсуд, або ж пропонується вибір із готових варіантів.',
          },
        ],
        functions: {
          image: 'voice-control',
          title: 'Можливості голосового управління будинком',
          text: 'Розумний будинок з голосовим управлінням – це рішення абсолютно в дусі часу, яке дасть вам змогу тримати все під контролем і при цьому не вимагатиме багато зусиль.',
          dropdownList: [
            {
              title: 'Запобігання зламанню',
              text: 'Інженерні комунікації під повним контролем – дізнавайтесь про систему опалення, стан труб, електрику, запускайте підключені електроприлади. Ви будете впевнені, що вдома все в порядку, навіть якщо ви далеко.',
            },
            {
              title: 'Керування через телефон',
              text: 'Встановіть бажану температуру в будинку до свого повернення додому, увімкніть улюблене радіо або трек, завжди тримайте на контролі, що відбувається на території та безпосередньо за дверима.',
            },
            {
              title: 'Відстеження всіх подій у приміщенні',
              text: 'У разі потреби передивляйтеся камери спостереження чи поспілкуйтесь з гостями, які приїхали раніше, а ви ще не вдома. Ви також зможете їх впустити до будинку, щоб вони не чекали надворі.',
            },
            {
              title: 'Створення сценаріїв',
              text: 'Розробляйте їх з огляду на функціонал вашого житла та встановленої системи, а також підключених приладів. Все можливо. І це доводить голосове управління будинком.',
            },
            {
              title: 'Виклик охоронної компанії',
              text: 'У разі виникнення ситуації, яка потребуватиме такого втручання, зможете викликати наряд поліції чи охорони.',
            },
          ]
        },
        equipment: {
          title: 'З чого складається керування голосом',
          text: 'Пристрої, що входять до системи керування голосом. Їх перелік можна змінювати згідно потреб та бюджету.',
          items: [
            {
              image: 'voice-control',
              title: 'Колонка Apple HomePod 2',
              text: 'Можна використовувати як голосового асистента чи колонку.',
            },
            {
              image: 'control-center',
              title: 'Центр керування',
              text: 'Хаб, що повʼязує усю екосистему і через який керується увесь будинок.',
            },
            {
              image: 'smart-intercom',
              title: 'Розумний відеодзвінок',
              text: 'Дає змогу віддалено спілкуватися з гостями і транслювати відео.',
            }
          ]
        },
        choose: {
          icon: 'white-micro',
          title: 'Як вибрати систему голосового управління',
          text: 'Встановлення голосового управління під ключ від нашої компанії – це вигідно, але варто знати, як правильно ' +
            'вибрати систему.  Враховуйте характеристики обладнання та його функціонал, також треба не забувати про власні уподобання (до чого звикли – Google чи Apple).',
        },
        automations: [
          {
            title: 'Трігер: Ви підʼїжджаєте до своєї домівки на авто',
            options: [
              {
                icon: 'blue-microphone',
                name: 'Кажете “Відчини ворота”'
              },
              {
                icon: 'blue-sensor',
                name: 'Датчик віддає сигнал системі'
              },
              {
                icon: 'blue-top-arrows',
                name: 'Ворота автоматично відчиняються'
              }
            ]
          },
          {
            title: 'Трігер: Ви повертаєтеся з магазину з повними руками пакетів',
            options: [
              {
                icon: 'blue-microphone',
                name: 'Кажете домофону: “Відкрий двері”'
              },
              {
                icon: 'blue-lock',
                name: 'Якщо ви авторизований резидент, розумний будинок відкриє двері '
              }
            ]
          },
          {
            title: 'Трігер: Ви вже лягли у ліжко спати, але забули вимкнути світло і декілька приладів',
            options: [
              {
                icon: 'blue-microphone',
                name: 'Кажете команду “Перейди у нічний режим”'
              },
              {
                icon: 'blue-light',
                name: 'Вимикається світло'
              },
              {
                icon: 'blue-bolt',
                name: 'Вимикаються усі наразі непотрібні розумні пристрої'
              },
              {
                icon: 'blue-blinds',
                name: 'Закриваються штори та ролети'
              },
              {
                icon: 'blue-shield',
                name: 'Будинок ставиться на сигналізацію'
              }
            ]
          }
        ],
        wirelessSystem: {
          title: 'Переваги голосового управління для «розумного будинку»',
          text: ' «Розумний будинок» із голосовим управлінням – це сучасний помічник, створений на основі технологій штучного інтелекту. Він виконуватиме ваші команди та зможе самостійно реалізовувати ті чи інші сценарії, які ви ж йому й пропишете.',
          dropdownList: [
            {
              title: 'Швидка інтеграція.',
              text: 'Встановлення можливе на будь-якому етапі, навіть тоді, коли вже зроблений ремонт – ніяких дротів та шнурів, система бездротова, всі стіни залишаються цілими.',
            },
            {
              title: 'Підбір комплекту під ваші потреби.',
              text: 'Насамперед варто врахувати кількість елементів, які потрібно підключати. Кожен із пристроїв, які інтегруються в систему «розумного будинку», ' +
                'програмується окремо. Також на вартість впливатиме, яке саме програмне забезпечення вибране, і, звісно, ваші особливі побажання.',
            },
            {
              title: 'Однозначність зчитування команд.',
              text: 'Не варто турбуватись, що голосове управління будинком загубить команду, навіть при наявності сторонніх шумів все одно ' +
                'відбуватиметься уловлювання звуків, на які здійснювалось програмування.',
            },
            {
              title: 'Сценарії потрібні саме вам.',
              text: 'Наприклад, коли лягаєте спати або ж хочете почитати книгу. У такому разі додаткові команди голосом ' +
                'давати не доведеться. Налаштування сценаріїв можливе на ваш розсуд, або ж пропонується вибір із готових варіантів.',
            },
          ]
        },
        haveQuestions: [
          {
            title: 'Скільки коштує голосове управління в «розумному будинку»?',
            text: 'Вартість системи залежить від індивідуальних особливостей вашого житла та інтегрованих у нього систем. ' +
              'Розрахунок проводиться в кожному випадку окремо. Щоб отримати консультацію, телефонуйте нашим менеджерам ' +
              'або звертайтеся іншим зручним способом.',
          },
          {
            title: 'Скільки триває встановлення системи голосового управління?',
            text: 'Встановлення голосового керування займе всього декілька годин, адже всі компоненти з’єднуються бездротовою ' +
              'системою. Це дозволяє уникнути свердління, утворення штроб для закладки кабелів та інших дій, з наслідками ' +
              'яких господарям довелося б справлятись надалі.',
          },
          {
            title: 'Чи є можливості розширення охоплення приладів та систем для керування голосовим управлінням?',
            text: 'Так, звичайно, потрібно лише додати обладнання чи інженерні комунікації в систему «розумного будинку».' +
              ' Якщо у вас виникне така необхідність, ми завжди раді прийти на допомогу.',
          },
          {
            title: 'Чи складно встановлювати систему голосового управління?',
            text: 'Ні, наші спеціалісти витратять на це декілька годин, адже не доведеться прокладати дроти та робити ' +
              'отвори в стінах. Вся система голосового керування бездротова.',
          },
          {
            title: 'Які системи можна підключати до голосового управління?',
            text: 'Розумні вимикачі, модулі управління шторами, жалюзі, ролетами, контролери для керування світлодіодними ' +
              'світильниками, датчики руху, присутності, освітленості, «розумний» домофон та замок, систему пожежної сигналізації тощо.',
          },
          {
            title: 'Чи можна інтегрувати голосове управління до присутніх приладів і не купувати нові?',
            text: 'Це залежить від конкретного прилада. Якщо він підтримує Zigbee зв’язок, тоді купувати нові не потрібно. ' +
              'При консультації наші майстри зможуть надати інформацію конкретно по кожному приладу.',
          },
          {
            title: 'Як я можу керувати системами, використовуючи голосове управління?',
            text: 'Керування відбувається безпосередньо в будинку через голосові команди або ж через смартфон, який підключений до системи.',
          },
          {
            title: 'Яке програмне забезпечення використовується для голосового управління?',
            text: 'Сучасні розробки в галузі програмного забезпечення для роботи такої системи активно розвиваються. ' +
              'Нині є рішення від Google Home та Apple HomeKit.',
          },
        ]
      }
    }
  },

  mounted() {
    setTimeout(() => {
      this.loading = false
    }, 300)
  }

})
</script>

<style scoped lang="scss">
@import 'vars';

</style>